loadtest/webhook-event.300.yml
config:
  target: http://localhost:3000
  http:
    # Set a max of five TCP connections per virtual user.
    maxSockets: 5
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 40
      name: Warm up phase
    - duration: 20
      arrivalRate: 50
      rampTo: 200
      name: Ramp up load
    - duration: 60
      arrivalRate: 300
      name: Spike phase
scenarios:
  - flow:
      - post:
          url: "/webhook-event"
          headers:
            x-line-signature: 6buSbrlRRm9OseSr4we6MFiDvlvrbKIwIJz6hTtlLME=
          json:
            destination: xxxxxxxxxx
            events:
            - type: message
              message:
                type: text
                id: '14353798921116'
                text: Hello, world
              timestamp: 1625665242211
              source:
                type: user
                userId: U80696558e1aa831...
              replyToken: 757913772c4646b784d4b7ce46d12671
              mode: active
              webhookEventId: 01FZ74A0TDDPYRVKNK77XKC3ZR
              deliveryContext:
                isRedelivery: false
            - type: follow
              timestamp: 1625665242214
              source:
                type: user
                userId: Ufc729a925b3abef...
              replyToken: bb173f4d9cf64aed9d408ab4e36339ad
              mode: active
              webhookEventId: 01FZ74ASS536FW97EX38NKCZQK
              deliveryContext:
                isRedelivery: false
            - type: unfollow
              timestamp: 1625665242215
              source:
                type: user
                userId: Ubbd4f124aee5113...
              mode: active
              webhookEventId: 01FZ74B5Y0F4TNKA5SCAVKPEDM
              deliveryContext:
                isRedelivery: false